MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_spi.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_spi.c
 **
 ** A detailed description is available at
 ** @link SpiGroup Serial Peripheral Interface description @endlink
 **
 **   - 2018-10-29  1.0  Yangjp  First version for Device Driver Library of Spi.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_spi.h"
#include "hc32f46x_utility.h"

#if (DDL_SPI_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup SpiGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for SPI unit */
#define IS_VALID_SPI_UNIT(x) \
    ((M4_SPI1 == (x)) ||     \
     (M4_SPI2 == (x)) ||     \
     (M4_SPI3 == (x)) ||     \
     (M4_SPI4 == (x)))

/*!< Parameter valid check for SS setup delay option */
#define IS_VALID_SS_SETUP_DEALY_OPTION(x)   \
    ((SpiSsSetupDelayTypicalSck1 == (x)) || \
     (SpiSsSetupDelayCustomValue == (x)))

/*!< Parameter valid check for SS setup delay time */
#define IS_VALID_SS_SETUP_DELAY_TIME(x) \
    ((SpiSsSetupDelaySck1 == (x)) ||    \
     (SpiSsSetupDelaySck2 == (x)) ||    \
     (SpiSsSetupDelaySck3 == (x)) ||    \
     (SpiSsSetupDelaySck4 == (x)) ||    \
     (SpiSsSetupDelaySck5 == (x)) ||    \
     (SpiSsSetupDelaySck6 == (x)) ||    \
     (SpiSsSetupDelaySck7 == (x)) ||    \
     (SpiSsSetupDelaySck8 == (x)))

/*!< Parameter valid check for SS hold delay time */
#define IS_VALID_SS_HOLD_DELAY_TIME(x) \
    ((SpiSsHoldDelaySck1 == (x)) ||    \
     (SpiSsHoldDelaySck2 == (x)) ||    \
     (SpiSsHoldDelaySck3 == (x)) ||    \
     (SpiSsHoldDelaySck4 == (x)) ||    \
     (SpiSsHoldDelaySck5 == (x)) ||    \
     (SpiSsHoldDelaySck6 == (x)) ||    \
     (SpiSsHoldDelaySck7 == (x)) ||    \
     (SpiSsHoldDelaySck8 == (x)))

/*!< Parameter valid check for SS hold delay option */
#define IS_VALID_SS_HOLD_DELAY_OPTION(x)   \
    ((SpiSsHoldDelayTypicalSck1 == (x)) || \
     (SpiSsHoldDelayCustomValue == (x)))

/*!< Parameter valid check for SS interval time option */
#define IS_VALID_SS_INTERVAL_TIME_OPTION(x)       \
    ((SpiSsIntervalTypicalSck1PlusPck2 == (x)) || \
     (SpiSsIntervalCustomValue == (x)))

/*!< Parameter valid check for SS interval time */
#define IS_VALID_SS_INTERVAL_TIME(x)       \
    ((SpiSsIntervalSck1PlusPck2 == (x)) || \
     (SpiSsIntervalSck2PlusPck2 == (x)) || \
     (SpiSsIntervalSck3PlusPck2 == (x)) || \
     (SpiSsIntervalSck4PlusPck2 == (x)) || \
     (SpiSsIntervalSck5PlusPck2 == (x)) || \
     (SpiSsIntervalSck6PlusPck2 == (x)) || \
     (SpiSsIntervalSck7PlusPck2 == (x)) || \
     (SpiSsIntervalSck8PlusPck2 == (x)))

/*!< Parameter valid check for SS valid channel select */
#define IS_VALID_SS_VALID_CHANNEL(x) \
    ((SpiSsValidChannel0 == (x)) ||  \
     (SpiSsValidChannel1 == (x)) ||  \
     (SpiSsValidChannel2 == (x)) ||  \
     (SpiSsValidChannel3 == (x)))

/*!< Parameter valid check for SS polarity */
#define IS_VALID_SS_POLARITY(x) \
    ((SpiSsLowValid == (x)) ||  \
     (SpiSsHighValid == (x)))

/*!< Parameter valid check for read data register object */
#define IS_VALID_READ_DATA_REG_OBJECT(x) \
    ((SpiReadReceiverBuffer == (x)) ||   \
     (SpiReadSendBuffer == (x)))

