MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_spi.c
        switch (enIrq)
        {
        case SpiIrqIdel:
            SPIx->CR1_f.IDIE = enNewSta;
            break;
        case SpiIrqReceive:
            SPIx->CR1_f.RXIE = enNewSta;
            break;
        case SpiIrqSend:
            SPIx->CR1_f.TXIE = enNewSta;
            break;
        case SpiIrqError:
            SPIx->CR1_f.EIE = enNewSta;
            break;
        default:
            break;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get SPI flag status
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enFlag                  SPI flag type
 ** \arg SpiFlagReceiveBufferFull       Receive buffer full flag
 ** \arg SpiFlagSendBufferEmpty         Send buffer empty flag
 ** \arg SpiFlagUnderloadError          Underload error flag
 ** \arg SpiFlagParityError             Parity error flag
 ** \arg SpiFlagModeFaultError          Mode fault error flag
 ** \arg SpiFlagSpiIdle                 SPI idle flag
 ** \arg SpiFlagOverloadErro            Overload error flag
 **
 ** \retval Set                         Flag is set
 ** \retval Reset                       Flag is reset
 **
 ******************************************************************************/
en_flag_status_t SPI_GetFlag(M4_SPI_TypeDef *SPIx, en_spi_flag_type_t enFlag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    if (IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_FLAG_TYPE(enFlag));

        switch (enFlag)
        {
        case SpiFlagReceiveBufferFull:
            enFlagSta = (en_flag_status_t)SPIx->SR_f.RDFF;
            break;
        case SpiFlagSendBufferEmpty:
            enFlagSta = (en_flag_status_t)SPIx->SR_f.TDEF;
            break;
        case SpiFlagUnderloadError:
            enFlagSta = (en_flag_status_t)SPIx->SR_f.UDRERF;
            break;
        case SpiFlagParityError:
            enFlagSta = (en_flag_status_t)SPIx->SR_f.PERF;
            break;
        case SpiFlagModeFaultError:
            enFlagSta = (en_flag_status_t)SPIx->SR_f.MODFERF;
            break;
        case SpiFlagSpiIdle:
            enFlagSta = (en_flag_status_t)(bool)(!SPIx->SR_f.IDLNF);
            break;
        case SpiFlagOverloadError:
            enFlagSta = (en_flag_status_t)SPIx->SR_f.OVRERF;
            break;
        default:
            break;
        }
    }

    return enFlagSta;
}

/**
 *******************************************************************************
 ** \brief Clear SPI flag status
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enFlag                  SPI flag type
 ** \arg SpiFlagReceiveBufferFull       Receive buffer full flag
 ** \arg SpiFlagSendBufferEmpty         Send buffer empty flag
 ** \arg SpiFlagUnderloadError          Underload error flag
 ** \arg SpiFlagParityError             Parity error flag
 ** \arg SpiFlagModeFaultError          Mode fault error flag
 ** \arg SpiFlagSpiIdle                 SPI empty flag
 ** \arg SpiFlagOverloadErro            Overload error flag
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_ClearFlag(M4_SPI_TypeDef *SPIx, en_spi_flag_type_t enFlag)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_FLAG_TYPE(enFlag));

        switch (enFlag)
        {
        case SpiFlagReceiveBufferFull:
            SPIx->SR_f.RDFF = 0u;
            break;
        case SpiFlagSendBufferEmpty:
            SPIx->SR_f.TDEF = 0u;
            break;
        case SpiFlagUnderloadError:
            SPIx->SR_f.UDRERF = 0u;
            break;
        case SpiFlagParityError:
            SPIx->SR_f.PERF = 0u;
            break;
        case SpiFlagModeFaultError:
            SPIx->SR_f.MODFERF = 0u;
            break;
        case SpiFlagSpiIdle:
            SPIx->SR_f.IDLNF = 0u;
            break;
        case SpiFlagOverloadError:
            SPIx->SR_f.OVRERF = 0u;
            break;
        default:
            break;
        }
        enRet = Ok;
    }

    return enRet;
}

//@} // SpiGroup

#endif /* DDL_SPI_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
